DmitriyKalashnikov1/STM32Projects/NRF24L01_oneCopterMsgBackapp/PID_Controller_Inverter_TPA/Test_G4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <stdbool.h>
#include "stm32g474xx.h"
#include "stm32g4xx_hal.h"
#include "Drivers/myGPIO.h"
#include "Drivers/myVoltageRead.h"
#include "Drivers/ACS712.h"
#include "Drivers/myNRF.h"


/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

typedef struct PID {
	float Kp;
	float Ki;
	float Kd;
} PID_t;

typedef enum PID_Param {
	Output_Current,
	Input_Power,
} PID_Param_e;

typedef struct DATA
{
    uint32_t V_out_int;
    uint32_t I_out_int;
} data_t;

typedef struct MESSAGE {
	uint32_t id;
    data_t data;

} message_t;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* Конфигурационные параметры ****************************************************************/
#define ADDR_WIDTH 5 // Размер адреса принимающего канал приемопередатчика
#define PLD_S 8 // Размер пакета принимаемых данных, байт
#define FILTER_SIZE 10 // Объем накапливаемых значений зарядного тока в алгоритме фильтрации
/********************************************************************************************/
#define period_WAIT 0x66A0
#define period_CHRG 0x66C0


/* [A] */
#define MAX_CURRENT 75.0f // Макисмальный допустимый ток в нагрузке
#define MIN_CURRENT 1.0f  // Минимальный допустимый ток в нагрузке
#define TARGET_CURRENT 70.0f // Целевое значение тока в нагрузке (для LB было 5.0f)

/* [B] */
#define MAX_CHARGE 35.0f // Макисмальное допустимое напряжение на нагрузке
#define MIN_CHARGE 15.0f  // Минимальное допустимое напряжение на нагрузке

#define VOLTAGE_SCALE 0.0855f // Коэфициент преобразования в вольты
#define CURRENT_SCALE 0.05f // [мA/В] Коэффициент преобразования в амперы

// пределы срабатывания фильтра
#define FILTER_INT_CURRENT_THRESHOLD 200
#define FILTER_INT_VOLTAGE_THRESHOLD 200

#define PID_TYPE Output_Current
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

COM_InitTypeDef BspCOMInit;
ADC_HandleTypeDef hadc1;

HRTIM_HandleTypeDef hhrtim1;

SPI_HandleTypeDef hspi1;

/* USER CODE BEGIN PV */
// Переменные для таймеров инвертера
uint16_t shift = 0;
uint16_t shift_normal = 0x0080;
uint16_t min_shift = 0x0080;

// Переменные для ПИД контроллера
float input = 0.0;  // PID constants
PID_t coeffs;
float previousError = 0.0f;   // Previous error for derivative term
float integral = 0.0f;        // Integral term
float P = 0.0f;
float I = 0.0f;
float D = 0.0f;
float error = 0.0f;
float ref = 5.0f;
float output = 0.0f;

// Переменные для обработки принятых пакетов данных


message_t message = {
	.id = 0,
	.data.V_out_int = 0,
	.data.I_out_int = 0
};

volatile uint32_t copter_id = 0;

// Физические измерения
volatile float copter_voltage = 0.0f;
volatile float copter_current = 0.0f;
volatile float copter_power = 0.0f;
float station_current = 0.0f;
float station_voltage = 0.0f;
float station_power = 0.0f;


// Переменные для фильтрации
volatile uint32_t receivedCurrents[FILTER_SIZE] = { 0 };
volatile uint32_t receivedVoltages[FILTER_SIZE] = { 0 };

volatile uint32_t sumI = 0;
volatile uint32_t cntI = 0;
volatile uint32_t sumV = 0;
volatile uint32_t cntV = 0;


// Переменные для коммуникации по SPI
const uint32_t CPOL = SPI_CR1_CPOL * 0;
const uint32_t CPHA = SPI_CR1_CPHA * 0;
const uint32_t pipe = 1024; //111156789; // адрес рабочей трубы;

// Переменные-счетчики
volatile uint32_t currentIndex = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_HRTIM1_Init(void);
/* USER CODE BEGIN PFP */
/*-------------- Функция итеративной фильтрации принятого значения зарядного тока --------------*/
void Filter()
{

	for (int i = 0; i < FILTER_SIZE; i++) {
		if (receivedCurrents[i] > FILTER_INT_CURRENT_THRESHOLD) {
			sumI += receivedCurrents[i];
			cntI++;
		}

		if (receivedVoltages[i] > FILTER_INT_VOLTAGE_THRESHOLD) {
			sumV += receivedVoltages[i];
			cntV++;
		}

	}


	copter_voltage = VOLTAGE_SCALE * (((sumV / cntV) * 3300.0) / 4096.0 );
	copter_current = CURRENT_SCALE * (((sumV / cntI) * 3300.0) / 4096.0 );

	copter_power = copter_voltage * copter_current;
}
// принимаем данные в прерывании на пине IRQ

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == NRF_IRQ_Pin){
		//printf("irq\n");

		NRF24_read(&message, sizeof(message));
	//	printf("copter id: %li\n\r", message.id);
	//	printf("copter I int: %li\n\r", message.I_out_int);
	//	printf("copter V int: %li\n\r", message.V_out_int);
		// если id бортового модуля не установлен -- записываем в него поле id
		// из принятого сообщения, т.е. выбираем данный модуль
		if (copter_id == 0){
			copter_id = message.id;
		}
		// если сообщение пришло от выбранного модуля -- записываем ток и напряжение
		// в массив для фильтрации, а также увеливаем счетчик принятых пакетов
		// чтобы вовремя отфильтровать значения
		if (message.id == copter_id){
			// фильтрация
			if (currentIndex <= FILTER_SIZE){
				receivedCurrents[currentIndex] = message.data.I_out_int;
				receivedVoltages[currentIndex] = message.data.V_out_int;
				currentIndex += 1;
			}else {
				currentIndex = 0;
				Filter();
			}
		}
		// если пришло сообщение от не выбранного модуля -- пропускаем его

