DmitriyKalashnikov1/STM32Projects/NRF24L01_oneCopterMsgBackapp/PID_Controller_Inverter_TPA/Test_G4/Core/Src/main.c
	}

}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/*-------------- ПИД контроллер --------------*/
void PID_Control(PID_Param_e param, PID_t *coeffs)
{
	if (param == Input_Power) {
		coeffs->Kp = 5.0f;
		coeffs->Ki = 0.0f;
		coeffs->Kd = 20.0f;
		input = copter_power;
		ref = 165.0;
	}
	else if (param == Output_Current) {
		coeffs->Kp = 180.0f;
		coeffs->Ki = 0.0f;
		coeffs->Kd = 500.0f;
		input = copter_current;
		ref = TARGET_CURRENT;
	}
	// Вычисление ошибки
	error = ref - input;

	// Удержание ошибки в рамках значений, имеющих физический смысл

	// Пропорциональное слагаемое
	P = coeffs->Kp * error;

	// Интегральное слагаемое
	integral += error;

	I = coeffs->Ki * integral;

	// Дифференциальное слагаемое
	D = coeffs->Kd * (error - previousError);

	/* Выходное значение ПИД контроллера. Интегральное слагаемое не используется для избежания накопления ошибки */
	output = P + I + D;

	// Обновление значени ошибки
	previousError = error;

	// Корректировка фазового сдвига
	shift += (int16_t)output;

	// Удержание значение фазового сдвига в рамках значений, имеющих физический смысл
	if (shift > ((period_CHRG / 2) - 0x0080)) shift = (period_CHRG / 2 - 2 * 0x0080);
	else if (shift < 0x0080) shift = 0;
	shift_normal = shift;

	// Установка скорректированного значений фазового сдвига
	if (shift_normal > 0) {
		__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_1, (period_CHRG / 2 - 0x0080 - shift_normal));
	}
}
/*-------------- Функция инициализации приемопередатчика --------------*/
void NRF24_Init(void)
{
	NRF24_begin(hspi1);
	//nrf24_DebugUART_Init(huart2);
	NRF24_setDataRate(RF24_250KBPS);
	NRF24_setCRCLength(RF24_CRC_16);
	//NRF24_setPALevel(RF24_PA_0dB);
	NRF24_setChannel(0x6f);
	NRF24_setPayloadSize(sizeof(message));
	NRF24_setAutoAck(0);
	NRF24_powerUp();
	NRF24_openReadingPipe(0, pipe);
	//NRF24_startListening();

   // printRadioSettings();
}

/*-------------- Функция установления частоты управляющего инвертором сигнала --------------*/
void HRTIM_Init(uint32_t period)
{
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_MASTER, period);
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, period);
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_D, period);

	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_1, period / 2 - 0x0080);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_2, period / 2);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_1, period / 2);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_D, HRTIM_COMPAREUNIT_1, period / 2);

	HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_MASTER);

	HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TD1);
	HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TD2);
	HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_D);

	HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TA1);
	HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TA2);
	HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_A);
}

/*-------------- Функция изменения фазового сдвига --------------*/
void Change_Shift(void)
{
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_MASTER, period_CHRG);
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, period_CHRG);
	__HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_D, period_CHRG);

	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_2, period_CHRG / 2);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A, HRTIM_COMPAREUNIT_1, period_CHRG / 2);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_D, HRTIM_COMPAREUNIT_1, period_CHRG / 2);

	// фазовый сдвиг устанавливается согласно прцедуре ПИД контроллера
	PID_Control(PID_TYPE, &coeffs);
	__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_1, (period_CHRG / 2 - 0x0080 - shift_normal));

}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_HRTIM1_Init();
  /* USER CODE BEGIN 2 */
  GPIO_Set(LED_MCU_ON_GPIO_Port, LED_MCU_ON_Pin);
  printf("HAL is inited. Init NRF...");

	/*-------------- Инициализация приемопередатчика --------------*/
	DelayMicro(5000);
	NRF24_Init();
	NRF24_flush_tx();
	printConfigReg();
	printStatusReg();
	printFIFOstatus();
	bool isP = NRF24_isNRF_Plus();
	DelayMicro(1000);
	printf("Done!\n");

//	printf("m size: %li, m t size: %li\n", sizeof(message), sizeof(message_t));

	// Установление частоты управляющего инвертором сигнала
	HRTIM_Init(period_WAIT);
  /* USER CODE END 2 */

  /* Initialize USER push-button, will be used to trigger an interrupt each time it's pressed.*/
  BSP_PB_Init(BUTTON_USER, BUTTON_MODE_EXTI);

  /* Initialize COM1 port (115200, 8 bits (7-bit data + 1 stop bit), no parity */
  BspCOMInit.BaudRate   = 115200;
  BspCOMInit.WordLength = COM_WORDLENGTH_8B;
  BspCOMInit.StopBits   = COM_STOPBITS_1;
  BspCOMInit.Parity     = COM_PARITY_NONE;
  BspCOMInit.HwFlowCtl  = COM_HWCONTROL_NONE;
  if (BSP_COM_Init(COM1, &BspCOMInit) != BSP_ERROR_NONE)
  {
    Error_Handler();
  }

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  //printf("Main loop start");
	// Основной цикл программы
	while (1)
	{	// секция БЕЗ прерываний для считывания показаний датчиком станции
		__disable_irq();
		// Считывание тока и напряжения зарядной станции
		station_current = ACS712_ReadCurrentDC(&hadc1);
		station_voltage = myVoltageRead(&hadc1);

		// Проверка на заданные диапазоны тока и напряжения зарядной станции
		if ((station_current > ACS712_20A_MAX_CURRENT)||(station_current < ACS712_20A_MIN_CURRENT)){
			GPIO_Set(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
		}
		else{
			GPIO_Reset(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
		}


