DmitriyKalashnikov1/STM32Projects/NRF24L01_oneCopterMsgBackapp/PID_Controller_Inverter_TPA/Test_G4/Core/Src/main.c
		if ((station_voltage > MAX_VOLTAGE)||(station_voltage < MIN_VOLTAGE)){
			GPIO_Set(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
		}
		else{
			GPIO_Reset(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
		}

		// Вывод информации по датчику
		//ACS712_DebugPrintf(&hadc1);
		// при нажатии на кнопку останавливаем таймер
		// при отжатии -- включаем
		int buttonStopState = pinReadDebounce(BUTTON_STOP_GPIO_Port, BUTTON_STOP_Pin, IS_BUTTON_PULLED_UP);
		//printf("\n\tDebug button stop: state %i", buttonStopState);
		int gerconState = pinReadDebounce(GERCON_IN_GPIO_Port, GERCON_IN_Pin, IS_BUTTON_PULLED_UP);
		//printf("\n\tDebug gercon: state %i", gerconState);

		__enable_irq();

		// ждем секунду для считывания пакета данных с бортового модуля
		NRF24_startListening();
		HAL_Delay(1000);
//		NRF24_stopListening();

		int dataIsHere = NRF24_available(); // после обработки прерывания -- сбрасываем флаги

		printf("Message id: %li\r\n", message.id);
		printf("Message i: %li\r\n", message.data.I_out_int);
		printf("Message v: %li\r\n", message.data.V_out_int);


		if (buttonStopState){
		//	printf("\n\t Button stop pressed, disable hrtim");
			__HAL_HRTIM_DISABLE(&hhrtim1, HRTIM_TIMERINDEX_MASTER);
			__HAL_HRTIM_DISABLE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A);
			__HAL_HRTIM_DISABLE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_E);
		}else{
//			printf("\n\t Button stop not pressed, enable hrtim");
			__HAL_HRTIM_ENABLE(&hhrtim1, HRTIM_TIMERINDEX_MASTER);
			__HAL_HRTIM_ENABLE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_A);
			__HAL_HRTIM_ENABLE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_E);
		}



		if (gerconState){
			// Если геркон нажат -- дрон на месте, заряжаем
			printf("\n\tGercon is pressed");

			// Проверка на заданные диапазоны тока и напряжения коптера
			if ((copter_current > MAX_CURRENT) | (copter_current < MIN_CURRENT)) {
				//state = WAIT;
				printf("\n\tCopter current are out of range, waiting 1 minute...");
				GPIO_Set(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
				HRTIM_Init(period_WAIT);
				__HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_MASTER, HRTIM_COMPAREUNIT_1, (period_WAIT / 2 - 0x0080));
				GPIO_Reset(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
				DelayMicro(60 * 1000000);
				printf("\n\tDone");
			}

			if ((copter_voltage > MAX_CHARGE) | (copter_voltage < MIN_CHARGE)) {
				//state = WAIT;
				printf("\n\tCopter voltage are out of range, waiting 1 minute...");
				GPIO_Set(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
				GPIO_Reset(LED_MCU_ERROR_GPIO_Port, LED_MCU_ERROR_Pin);
				DelayMicro(60 * 1000000);
				printf("\n\tDone");
				}

			if ((copter_current > MIN_CURRENT) & (copter_current < MAX_CURRENT) & (copter_voltage > MIN_CHARGE) & (copter_voltage < MAX_CHARGE))
			{
				//state = CHRG;
				printf("\n\t State: Charge");
				HRTIM_Init(period_CHRG);
				__disable_irq();
				Change_Shift();
				__enable_irq();

				HAL_GPIO_TogglePin(LED_MCU_STATE_GPIO_Port, LED_MCU_STATE_Pin);
				HAL_Delay(500);
			}
			else
			{
				// процедура ожидания
				//state = WAIT;

				printf("\n\t State: WAIT");
				HRTIM_Init(period_WAIT);
				GPIO_Set(LED_MCU_STATE_GPIO_Port, LED_MCU_STATE_Pin);
			}

		}
		else{
			// если коптер улетел и геркон не нажат -- обнуляем переменную-id
			copter_id = 0;
		}
		// задержка между итерациями
		//HAL_Delay(500);

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	}
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
  RCC_OscInitStruct.PLL.PLLN = 85;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_MultiModeTypeDef multimode = {0};
  ADC_InjectionConfTypeDef sConfigInjected = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */

  /** Common config
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.GainCompensation = 0;
  hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  hadc1.Init.LowPowerAutoWait = DISABLE;
  hadc1.Init.ContinuousConvMode = DISABLE;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.Overrun = ADC_OVR_DATA_PRESERVED;
  hadc1.Init.OversamplingMode = DISABLE;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the ADC multi-mode
  */
  multimode.Mode = ADC_MODE_INDEPENDENT;
  if (HAL_ADCEx_MultiModeConfigChannel(&hadc1, &multimode) != HAL_OK)
  {
    Error_Handler();
  }

